{
   "posts":[
      {
        "title": "The Benefits of Cloud Hosted Development in 2023",
        "subtitle": "With every new technology, you either keep up or get left behind",
        "author": "Bonnie Green",
        "authorImage": "/images/ai-face-1.jpg",
        "authorTitle": "Marketing Advisor",
        "img": "/images/blog-1.png",
        "body": "In 2023, cloud computing continues to be a game-changer for businesses, offering unmatched scalability, cost efficiency, and accessibility. It allows organizations to easily adjust computing resources, optimize IT spending, and facilitate remote collaboration. Moreover, the cloud enhances security measures and compliance, ensuring data protection in an increasingly digital world. Its integration with emerging technologies like AI and data analytics empowers data-driven decision-making, while sustainability initiatives make it an eco-friendly choice, cementing its role as an essential tool for businesses striving to succeed in today's competitive landscape.",
        "slug": "cloud-computing-essential"
      },
      {
        "title":  "Implementing a New State-of-the-Art Security System Across Our Platform",
        "subtitle": "CloudByte is implementing a industry leading security system across it's entire platform. Find out the basics of how one of the worlds best security systems works.",
        "author": "Ivan Horvat",
        "authorImage": "/images/ai-face-2.jpg",
        "authorTitle": "Information Security Analyst",
        "img": "/images/blog-2.jpeg",
        "body": "Exciting News: At CloudByte, we're thrilled to announce the implementation of our cutting-edge security system, setting a new standard in safeguarding your data and privacy. In an era where digital threats are ever-evolving, we've harnessed the latest advancements in cybersecurity to ensure that your information remains secure, both in transit and at rest. Our commitment to protecting your valuable data is unwavering, and this state-of-the-art security system reinforces our dedication to providing you with the utmost confidence in the safety and integrity of your digital assets. Stay tuned for more updates as we continue to raise the bar in cybersecurity at CloudByte. Your peace of mind is our top priority!",
        "slug": "new-security-system"
      },
      {
        "title": "New CloudByte Server Built in Germany",
        "subtitle": "As one of the worlds largest PaaS providers we need servers across the world. With the European market growing at a very fast rate, we've built a new server in Germany to provide even more bandwith to our European clients.",
        "author": "Sara Kovač",
        "authorImage": "/images/ai-face-3.webp",
        "authorTitle": "PR Manager",
        "img": "/images/blog-3.avif",
        "body": "CloudByte is thrilled to announce our latest endeavor in expanding our global infrastructure. We're building a brand-new, state-of-the-art server facility in Germany, further enhancing our commitment to providing high-performance and secure cloud solutions to our valued clients. With this strategic investment, we aim to bring our services even closer to our European customers, ensuring lower latency, improved reliability, and compliance with local data regulations. This new server facility represents a significant milestone in our mission to deliver top-tier cloud services worldwide. Stay tuned for updates on this exciting project, as we continue to grow and evolve to meet your evolving needs. Your success is our motivation!",
        "slug": "new-server-built"
      },
      {
        "title": "Junior Frontend Developer",
        "subtitle": "We're looking for a Junior Frontend Developer in our office in Split. Are you passionate about creating stunning and user-friendly web interfaces? Do you have a strong desire to learn and grow in the field of frontend development? If so, we have an exciting opportunity for you!",
        "demands": ["Knows about React", "Has a good knowledge of HTML, CSS & JavaScript"],
        "location": "Split",
        "offers": ["1400 EUR Gross salary", "An indefinite contract", "Performance reviews every 6 months", "16'' MacBook", "Christmas & Easter bonuses"],
        "slug": "junior-frontend-split"
      },
      {
       "title": "Senior Backend Developer",
       "subtitle": "We're looking for a Senior Backend Developer in our office in Split. We're on the lookout for an experienced and visionary Senior Backend Developer to spearhead our innovation hub and drive our backend development efforts to new heights. Join us in shaping the future of our digital landscape!",
       "demands": ["6+ years of experience with Node.js", "Is experienced with CI/CD", "Has a good understanding of database best practices and structures"],
       "location": "Split",
       "offers": ["4000 EUR Gross salary", "An indefinite contract", "Performance reviews every 6 months", "16'' MacBook", "Christmas & Easter bonuses"],
       "slug": "senior-backend-split"
       },
      {
       "title": "Senior Full-Stack Engineer",
       "subtitle": "We're looking for a Senior Full-Stack Engineer in our office in Split. Are you a versatile and experienced Full Stack Engineer looking for your next career leap? Your journey to new heights begins here!",
       "demands": ["4+ years of experience","Has good expreience with Node.js and React", "Is experienced with CI/CD", "Is experienced in automation, basic system administration, scaling and product deployment (DevOps)", "Is experienced in API integration, cross-browser development, polyfills and responsive design"],
       "location": "Split",
       "offers": ["4000 EUR Gross salary", "An indefinite contract", "Performance reviews every 6 months", "16'' MacBook", "Christmas & Easter bonuses"],
       "slug": "senior-full-stack-split"
       },
      {
       "title": "Project Manager",
       "subtitle": "We're looking for a Project Manager in our office in Split. Are you a skilled Project Manager with a knack for orchestrating complex endeavors to deliver exceptional results? Join us and be the driving force behind our project excellence.",
       "demands": ["3+ years of experience","Has good understanding of Business, UX and Tech", "Has a strong desire to shape, build and deliver digital projects", "Is capable of leading a project from start to end"],
       "location": "Split",
       "offers": ["3500 EUR Gross salary", "An indefinite contract", "Performance reviews every 6 months", "16'' MacBook", "Christmas & Easter bonuses"],
       "slug": "project-manager-split"
       },
       {
       "title": "UI/UX Designer",
       "subtitle": "We're looking for a UI/UX in our office in Split. Are you a creative and detail-oriented UI/UX Designer passionate about shaping user-centric digital experiences? Start your journey to redefine user experiences today!",
       "demands": ["1+ year of experience","Familiar with creating user flows and information architecture maps", "Knows his way around Figma", "Has the ability to present his work"],
       "location": "Split",
       "offers": ["2500 EUR Gross salary", "An indefinite contract", "Performance reviews every 6 months", "16'' MacBook", "Christmas & Easter bonuses"],
       "slug": "ui-ux-designer-split"
       },
       {
       "title": "UI/UX Designer",
       "subtitle": "We're looking for a UI/UX in our office in Zagreb. Are you a creative and detail-oriented UI/UX Designer passionate about shaping user-centric digital experiences? If you have a keen eye for aesthetics, a deep understanding of user behavior, and a talent for crafting intuitive and visually appealing interfaces, we invite you to join our team. Be part of a dynamic environment where your design expertise will play a pivotal role in creating captivating and user-friendly products that leave a lasting impression. Start your journey to redefine user experiences today!",
       "demands": ["1+ year of experience","Familiar with creating user flows and information architecture maps", "Knows his way around Figma", "Has the ability to present his work"],
       "location": "Zagreb",
       "offers": ["2500 EUR Gross salary", "An indefinite contract", "Performance reviews every 6 months", "16'' MacBook", "Christmas & Easter bonuses"],
       "slug": "ui-ux-designer-zagreb"
       }
   ]
}